A = [["Пушкин А.С.","Капитанская дочка"],["Чехов А.П.","Вишневый сад"],["Толстой Л.Н.","Война и мир"]]
writers = dict(A)
print("Словарь: ")
print(writers)

print("Чехов написал пьесу: ",writers["Чехов А.П."])
writers["Чехов А.П."] = "Каштанка"
print("Словарь после изменения элемента: ")
print(writers)
writers["Достоевский Ф.М."]="Престпление и наказание"
print("Словарь после добавления элемента:")
print(writers)
print()

print("Авторы и их произведения:")
for s in writers.keys():
    print("Автор",s)
    print("Произведение:",writers[s])
    print()
    
lights = dict(красный="движение запрещено",желтый="всем внимание", зеленый="движение разрешено")

print("Новый словарь")
print(lights)
color="зеленый"

print("Если горит",color," свет, то", lights[color]+"!")
print()
girls ={(90,60,90):"Света",(85,65,89):"Юля",(92,58,91):"Нина"}
print("Еще один словарь")
print(girls)
params=(90,60,90)
print(girls[params]+":",params)
